---
kind: other
id: Properties.T:Autodesk.Revit.DB.DWGImportOptions
source: html/19f4cadb-53eb-5e85-5289-022d24c076b0.htm
---
# DWGImportOptions Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.